import s from './AboutMe.module.scss'

export default function AboutMe() {

 return (
  <>
    <section id='About' className={s.about_me}>
      <div className={s.about_me_content}>
        <h2 className={s.heading}>AboutMe</h2>
        <p className={s.text}>
          Я владею широким спектром навыков, необходимых для создания качественных интерфейсов. Мое владение HTML, CSS и JavaScript позволяет мне воплощать в жизнь уникальные и интуитивно понятные пользовательские веб-приложения.
        </p>
        <p className={s.text}>
          Однако, мои навыки не ограничиваются только базовыми языками. Я имею опыт работы с различными фреймворками и библиотеками, включая React и Vue.js. Это позволяет мне создавать сложные и масштабируемые веб-приложения, учитывая современные требования и стандарты.
        </p>
        <p className={s.text}>
          Я постоянно стремлюсь к самосовершенствованию и всегда открыт новым вызовам. Я активно следую трендам в области веб-разработки и стараюсь применять новые инструменты и технологии для достижения лучших результатов.
        </p>
        <p className={s.text}>
          Кроме того, я ценю коллаборацию и командную работу. Я открыт для обмена знаниями и опытом с коллегами, и считаю, что лучшие результаты достигаются в сотрудничестве. Я готов делиться своими идеями и вносить свой вклад в развитие проектов.
        </p>
        <p className={s.text}>
          В моей работе я придерживаюсь лучших практик и стараюсь создавать эффективный и оптимизированный код. Я обращаю внимание на детали и стремлюсь к безупречному пользовательскому опыту.</p>
        <p className={s.text}>
           В свободное время я продолжаю изучать новые технологии и практики, а также участвую в онлайн-курсах и вебинарах для постоянного развития. Я стремлюсь быть в курсе последних тенденций и инноваций в области веб-разработки.
        </p>
        <p className={s.text}>
          В заключение, я готов внести свой вклад в вашу команду как midlle frontend dev. Я обладаю необходимыми навыками, мотивацией и преданностью достижению отличных результатов. Буду рад присоединиться к увлекательным проектам и совместной работе с вами! 
        </p>
      </div>
    </section>
  </>
 )
} 